# Вычислить число ПИ c заданной точностью d
import math
print(str(math.pi)[:2+int(input('Введите количество знаков после запятой: '))])